#include <stdio.h>

int main() {
    int i = 2;  //กำหนดค่าเริ่มต้นของ i เป็น 2

    while (i <= 10) {   //เงื่อนไขในการทำซ้ำ ถ้า i น้อยกว่าหรือเท่ากับ 10
        printf("%d ", i);   //แสดงค่าของ i
        i += 2; //เพิ่มค่า i ทีละ 2
    }
    printf("\nEnd of loop\n");  //แสดงข้อความ End of loop เมื่อจบการทำซ้ำ
    return 0;   //คืนค่า 0
}
//while loop จะทำงานตราบใดที่เงื่อนไขเป็นจริง (true)
//ในที่นี้จะทำการแสดงค่าของ i ตั้งแต่ 2 ถึง 10 โดยเพิ่มค่า i ทีละ 2 ในแต่ละรอบของ loop    
//while ต่างจาก for loop ตรงที่ while loop จะต้องมีการกำหนดค่าเริ่มต้นของตัวแปรนอก loop และการเพิ่มค่าของตัวแปรภายใน loop เอง