#include <stdio.h>

int main() {
    for (int i = 2; i <= 10; i += 2) {  // กำหนดค่าเริ่มต้นของ i เป็น 2, เงื่อนไขในการทำซ้ำ ถ้า i <= 10, เพิ่มค่า i ทีละ 2
        printf("%d ", i);   // แสดงค่าของ i
    }   
    printf("\nEnd of loop\n");  // แสดงข้อความ End of loop เมื่อจบการทำซ้ำ
    
    return 0;   // คืนค่า 0
}
// for loop จะทำงานตราบใดที่เงื่อนไขเป็นจริง (true)
// ในที่นี้จะทำการแสดงค่าของ i ตั้งแต่ 2 ถึง 10 โดยเพิ่มค่า i ทีละ 2 ในแต่ละรอบของลูป
// for loop ต่างจาก while loop ตรงที่ for loop จะมีการกำหนดค่าเริ่มต้น, เงื่อนไข, และการเพิ่มค่าของตัวแปรในบรรทัดเดียวกัน
